[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:25:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="orgCode">Org Code</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-orgCode"}
-                id="orgCode"
-                type="text"
-                {...register("orgCode")}
-                value={initialContents.orgCode}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
       </Row>
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:25:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="orgCode">Org Code</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-orgCode"}
-                id="orgCode"
-                type="text"
-                {...register("orgCode")}
-                value={initialContents.orgCode}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
