[Survived] BooleanLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:145:54
               id="done"
               label="Done"
               type="checkbox"
-              {...register("done", { valueAsBoolean: true })}
+              {...register("done", { valueAsBoolean: false })}
             />
           </Form.Group>

[Survived] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:145:36
               id="done"
               label="Done"
               type="checkbox"
-              {...register("done", { valueAsBoolean: true })}
+              {...register("done", {})}
             />
           </Form.Group>
