[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "dateAdded is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticleForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /dateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:120:27
               type="text"
               isInvalid={Boolean(errors.url)}
               {...register("url", {
-                required: "url is required.",
+                required: "",
               })}
             />
killedBy: ArticleForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /url is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
