[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:57:20
     },
     {
       header: "DateAdded",
-      accessorKey: "dateAdded",
+      accessorKey: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"

[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:64:56
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "ArticleTable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticleTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"
