[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={"HelpRequestForm-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.jsx:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={"HelpRequestForm-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={"HelpRequestForm-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: HelpRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:50:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="requesterEmail">Requester Email</Form.Label>
         <Form.Control
-          data-testid={"HelpRequestForm-requesterEmail"}
+          data-testid={""}
           id="requesterEmail"
           type="email"
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element by: [data-testid="/HelpRequestForm-requesterEmail/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:85:24
           Table or Breakout Room
         </Form.Label>
         <Form.Control
-          data-testid={"HelpRequestForm-tableOrBreakoutRoom"}
+          data-testid={""}
           id="tableOrBreakoutRoom"
           type="text"
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:112:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestTime && "Request Time is required"}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:135:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="solved">Solved</Form.Label>
         <Form.Check
-          data-testid={"HelpRequestForm-solved"}
+          data-testid={""}
           id="solved"
           type="checkbox"
killedBy: HelpRequestForm tests solved checkbox is present and unchecked by default
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
