[Killed] ArrowFunction
main/components/HelpRequests/HelpRequestsTable.jsx:61:13
     {
       header: "Solved",
       accessorKey: "solved",
-      cell: (info) => (info.getValue() ? "Yes" : "No"),
+      cell: () => undefined,
     },
   ];
killedBy: HelpRequestsTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestsTable.jsx:61:42
     {
       header: "Solved",
       accessorKey: "solved",
-      cell: (info) => (info.getValue() ? "Yes" : "No"),
+      cell: (info) => (info.getValue() ? "" : "No"),
     },
   ];
killedBy: HelpRequestsTable tests Has the expected column headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] BlockStatement
main/components/HelpRequests/HelpRequestsTable.jsx:65:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestsTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestsTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: HelpRequestsTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="HelpRequestsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestsTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestsTable.jsx:70:56
       ButtonColumn("Edit", "primary", editCallback, "HelpRequestsTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestsTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: HelpRequestsTable tests Has the expected column headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="HelpRequestsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestsTable"
