[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:52:38
               id="itemId"
               type="number"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "Item Id is required.",
-                valueAsNumber: true,
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct error messages on missing input
statusReason: Unable to find an element with the text: /Item Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:93:32
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "Stars is required.",
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: { value: 1, message: "Stars must be at least 1." },
                 max: { value: 5, message: "Stars must be at most 5." },
killedBy: MenuItemReviewForm tests No error messages on good input
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Anything ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:120:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "Date Reviewed is required. "}
+              {errors.dateReviewed || "Date Reviewed is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Found multiple elements with the text: /Date Reviewed/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="dateReviewed"
