[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "ItemId",
-      accessorKey: "itemId",
-    },
+    {},
     {
       header: "ReviewerEmail",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:60:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:62:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:62:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
+      ButtonColumn("Edit", "", editCallback, "MenuItemReviewTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:65:20
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewTable"),
+      ButtonColumn("", "danger", deleteCallback, "MenuItemReviewTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header
