[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.jsx:71:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail && "ProfessorEmail is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /ProfessorEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
