[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:59:20
     },
     {
       header: "DateNeeded",
-      accessorKey: "dateNeeded",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:61:5
       header: "DateNeeded",
       accessorKey: "dateNeeded",
     },
-    {
-      header: "Done",
-      accessorKey: "done",
-      cell: (info) => (info.getValue() ? "Yes" : "No"),
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestsTable.jsx:64:13
     {
       header: "Done",
       accessorKey: "done",
-      cell: (info) => (info.getValue() ? "Yes" : "No"),
+      cell: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:
