[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id",
-    },
-    {
-      header: "Dining Commons Code",
-      accessorKey: "diningCommonsCode",
-    },
-    {
-      header: "Name",
-      accessorKey: "name",
-    },
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three items correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
