[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:98:28
               data-testid={testIdPrefix + "-inactive"}
               id="inactive"
               type="checkbox"
-              {...register("inactive")}
+              {...register("")}
             />
           </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
