[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:37:5
   };
 
   const columns = [
-    {
-      header: "Org Code",
-      accessorKey: "orgCode",
-    },
+    {},
     {
       header: "Organization Translation Short",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:39:20
   const columns = [
     {
       header: "Org Code",
-      accessorKey: "orgCode",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:46:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "Organization Translation",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
