[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} explanation: ${recommendationRequest.explanation}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:46:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} explanation: ${recommendationRequest.explanation}`,
+      ``,
     );
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "RecommendationRequest Updated - id: 17 explanation: Christmas Morning",
