[Killed] ArrayDeclaration
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequests/all"],
     { method: "GET", url: "/api/recommendationrequests/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: RecommendationRequestsIndexPage tests renders empty table when backend unavailable, user only
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="RecommendationRequestsTable-cell-row-0-col-id"
/> instead
