[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:19:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(
-      `New UCSBOrganization Created - orgCode: ${ucsbOrganization.orgCode} orgTranslationShort: ${ucsbOrganization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:21:7
 
   const onSuccess = (ucsbOrganization) => {
     toast(
-      `New UCSBOrganization Created - orgCode: ${ucsbOrganization.orgCode} orgTranslationShort: ${ucsbOrganization.orgTranslationShort}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New UCSBOrganization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO",
