[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganizations?orgCode=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganizations`,
-      params: {
-        orgCode: id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO UPDATED",

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:28:57
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (ucsbOrganization) => ({});
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO UPDATED",

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:31:13
   const objectToAxiosPutParams = (ucsbOrganization) => ({
     url: "/api/ucsborganizations",
     method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
+    params: {},
     data: {
       orgTranslationShort: ucsbOrganization.orgTranslationShort,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected {} to deeply equal { orgCode: 'ZPR' }

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:34:11
     params: {
       orgCode: ucsbOrganization.orgCode,
     },
-    data: {
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected '{}' to be '{"orgTranslationShort":"ZETA PHI RHO …' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:41:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(
-      `UCSBOrganization Updated - orgCode: ${ucsbOrganization.orgCode} orgTranslationShort: ${ucsbOrganization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:43:7
 
   const onSuccess = (ucsbOrganization) => {
     toast(
-      `UCSBOrganization Updated - orgCode: ${ucsbOrganization.orgCode} orgTranslationShort: ${ucsbOrganization.orgTranslationShort}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization Updated - orgCode: ZPR orgTranslationShort: ZETA PHI RHO UPDATED",

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            initialContents={ucsbOrganization}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
