[Killed] ConditionalExpression
src/main/utils/UCSBOrganizationUtils.js:6:9
 // Stryker disable next-line all
 export function onDeleteSuccess(message) {
   console.log(message);
-  toast(message.message || message);
+  toast(false);
 }
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization with orgCode ZPR was deleted",

[Killed] ConditionalExpression
src/main/utils/UCSBOrganizationUtils.js:6:9
 // Stryker disable next-line all
 export function onDeleteSuccess(message) {
   console.log(message);
-  toast(message.message || message);
+  toast(true);
 }
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization with orgCode ZPR was deleted",

[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:9:47
   toast(message.message || message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBOrganization with orgCode ZPR was deleted",
