[Killed] StringLiteral
src/main/utils/ucsbDiningCommonsMenuItemUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/ucsbdiningcommonsmenuitem",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.original.id,
killedBy: UCSBDiningCommonsMenuItemIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem with id 1 was deleted",
